Tekla Open API Reference for Tekla Structures 2025
DotPrintOrientationType Enumeration
 The print orientation type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintOrientationType
Public Enumeration DotPrintOrientationType
Members
Member name | Value | Description
Auto | 0 |  Auto orientation.
Landscape | 1 |  Landscape orientation.
Portrait | 2 |  Portrait orientation.
See Also
Reference
Tekla.Structures.Drawing Namespace